app/Controllers/Dashboard.php

    public function index()
    {
        // TOTAL
        $total = $this->itemModel->countAll();

        // KONDISI
        $baik   = $this->itemModel->where('item_condition', 'baik')->countAllResults();
        $rusak  = $this->itemModel->where('item_condition', 'rusak')->countAllResults();
        $hilang = $this->itemModel->where('item_condition', 'hilang')->countAllResults();
        $habis  = $this->itemModel->where('item_condition', 'habis')->countAllResults();

        // 🔥 KATEGORI OTOMATIS (INI YANG KURANG TADI)
        $kategoriData = $this->itemModel
            ->select('category, COUNT(*) as total')
            ->groupBy('category')
            ->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `items`
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_condition` = 'baik'
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_condition` = 'rusak'
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_condition` = 'hilang'
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_condition` = 'habis'
SELECT `category`, COUNT(*) as total
FROM `items`
GROUP BY `category`