app/Controllers/Item.php

    public function index()
{
    $keyword = $this->request->getGet('keyword');

    $builder = $this->itemModel;

    if ($keyword) {
        $builder = $builder
            ->groupStart()
                ->like('kode_barang', $keyword)
                ->orLike('name', $keyword)
                ->orLike('category', $keyword)
                ->orLike('location', $keyword)
                ->orLike('jenis_aset', $keyword)
            ->groupEnd();
    }

    $page = (int) ($this->request->getVar('page') ?? 1);

    $items = $builder->paginate(5);
    $pager = $this->itemModel->pager;

    $total = $this->itemModel->countAll();

    $baik   = (new ItemModel())->where('item_condition', 'baik')->countAllResults();
    $rusak  = (new ItemModel())->where('item_condition', 'rusak')->countAllResults();
    $hilang = (new ItemModel())->where('item_condition', 'hilang')->countAllResults();
---
SELECT *
FROM `items`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `items`
SELECT COUNT(*) AS `numrows` FROM `items`
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_condition` = 'hilang'
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_condition` = 'baik'