app/Controllers/Peminjaman.php

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
JOIN `items` ON `items`.`id` = `peminjaman`.`barang_id`
SELECT `peminjaman`.*, `items`.`name`
FROM `peminjaman`
JOIN `items` ON `items`.`id` = `peminjaman`.`barang_id`
 LIMIT 10
---
    public function index()
    {
        $data = [
            'title' => 'Peminjaman',
            'data' => $this->peminjamanModel
                ->select('peminjaman.*, items.name')
                ->join('items', 'items.id = peminjaman.barang_id')
                ->paginate(10),

SELECT *
FROM `items`
---
    public function create()
    {
        return view('peminjaman/create', [
            'title' => 'Tambah Peminjaman',
            'items' => $this->itemModel->findAll()

SELECT *
FROM `items`
WHERE `items`.`id` = '18'
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
INSERT INTO `peminjaman` (`kode_peminjaman`, `nama_peminjam`, `barang_id`, `jumlah`, `tanggal_pinjam`, `status`, `keterangan`, `created_at`, `updated_at`) VALUES ('PJM-2026-0001', 'Ibu Guru', '18', 3, '2026-06-09', 'dipinjam', '', '2026-06-09 04:58:15', '2026-06-09 04:58:15')
UPDATE `items` SET `stock` = 27, `updated_at` = '2026-06-09 04:58:15'
WHERE `items`.`id` IN ('18')
---
    public function store()
    {
        $barang = $this->itemModel->find(
            $this->request->getPost('barang_id')
        );

        if (!$barang) {
            return redirect()->back()
                ->with('error', 'Barang tidak ditemukan');
        }

        $jumlah = (int)$this->request->getPost('jumlah');

        if ($jumlah > $barang['stock']) {
            return redirect()->back()
                ->with('error', 'Stok tidak mencukupi');
        }

        $kode = 'PJM-' . date('Y') . '-' . str_pad(
            $this->peminjamanModel->countAll() + 1,
            4,
            '0',
            STR_PAD_LEFT
        );

        $this->peminjamanModel->save([
            'kode_peminjaman' => $kode,
            'nama_peminjam' => $this->request->getPost('nama_peminjam'),
            'barang_id' => $this->request->getPost('barang_id'),
            'jumlah' => $jumlah,
            'tanggal_pinjam' => $this->request->getPost('tanggal_pinjam'),
            'status' => 'dipinjam',
            'keterangan' => $this->request->getPost('keterangan')
        ]);

        // Kurangi stok barang
        $this->itemModel->update($barang['id'], [
            'stock' => $barang['stock'] - $jumlah
        ]);