app/Controllers/Pengadaan.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $builder = $this->model;

        if ($keyword) {
            $builder = $builder
                ->groupStart()
                ->like('kode_pengadaan', $keyword)
                ->orLike('nama_barang', $keyword)
                ->orLike('jenis_aset', $keyword)
                ->orLike('pemasok', $keyword)
                ->groupEnd();
        }

        $data['data'] = $builder->paginate(5);
        $data['pager'] = $this->model->pager;

        $data['totalPengadaan'] = $this->model->countAll();

        $data['proses'] = $this->model
            ->where('status', 'proses')
            ->countAllResults();

        $data['selesai'] = $this->model
            ->where('status', 'selesai')
            ->countAllResults();

        $data['dibatalkan'] = $this->model
            ->where('status', 'dibatalkan')
            ->countAllResults();
---
SELECT *
FROM `pengadaan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pengadaan`
SELECT COUNT(*) AS `numrows` FROM `pengadaan`
SELECT COUNT(*) AS `numrows`
FROM `pengadaan`
WHERE `status` = 'proses'
SELECT COUNT(*) AS `numrows`
FROM `pengadaan`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `pengadaan`
WHERE `status` = 'dibatalkan'

    public function store()
    {
        $jumlah = (int) $this->request->getPost('jumlah');
        $hargaSatuan = (int) $this->request->getPost('harga_satuan');

        $totalHarga = $jumlah * $hargaSatuan;

        $this->model->save([
            'kode_pengadaan' => $this->request->getPost('kode_pengadaan'),
            'nama_barang' => $this->request->getPost('nama_barang'),
            'jenis_aset' => $this->request->getPost('jenis_aset'),
            'jumlah' => $jumlah,
            'harga_satuan' => $hargaSatuan,
            'tanggal_pengadaan' => $this->request->getPost('tanggal_pengadaan'),
            'pemasok' => $this->request->getPost('pemasok'),
            'total_harga' => $totalHarga,
            'sumber_dana' => $this->request->getPost('sumber_dana'),
            'lokasi_penempatan' => $this->request->getPost('lokasi_penempatan'),
            'keterangan' => $this->request->getPost('keterangan'),
            'status' => 'proses'
        ]);
---
INSERT INTO `pengadaan` (`kode_pengadaan`, `nama_barang`, `jenis_aset`, `jumlah`, `harga_satuan`, `tanggal_pengadaan`, `pemasok`, `total_harga`, `sumber_dana`, `lokasi_penempatan`, `keterangan`, `status`, `created_at`, `updated_at`) VALUES ('PGD-2026-0001', 'Bangku Sekolah', 'Sarana', 10, 50000, '2026-06-09', 'TB Pagaden', 500000, 'Yayasan', 'Kelas 11A', '', 'proses', '2026-06-09 04:56:16', '2026-06-09 04:56:16')