app/Controllers/Pengembalian.php

SELECT COUNT(*) AS `numrows`
FROM `pengembalian`
JOIN `peminjaman` ON `peminjaman`.`id` = `pengembalian`.`peminjaman_id`
SELECT `pengembalian`.*, `peminjaman`.`nama_peminjam`
FROM `pengembalian`
JOIN `peminjaman` ON `peminjaman`.`id` = `pengembalian`.`peminjaman_id`
 LIMIT 10
---
    public function index()
    {
        $data = [
            'title' => 'Pengembalian',
            'data' => $this->pengembalianModel
                ->select('pengembalian.*, peminjaman.nama_peminjam')
                ->join(
                    'peminjaman',
                    'peminjaman.id = pengembalian.peminjaman_id'
                )
                ->paginate(10),

SELECT *
FROM `peminjaman`
WHERE `status` = 'dipinjam'
---
    public function create()
    {
        $pinjam = $this->peminjamanModel
            ->where('status', 'dipinjam')
            ->findAll();

SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '3'
SELECT COUNT(*) AS `numrows` FROM `pengembalian`
INSERT INTO `pengembalian` (`kode_pengembalian`, `peminjaman_id`, `tanggal_kembali`, `kondisi_barang`, `keterangan`, `created_at`, `updated_at`) VALUES ('KMB-2026-0001', '3', '2026-06-09', 'baik', '', '2026-06-09 04:59:36', '2026-06-09 04:59:36')
UPDATE `peminjaman` SET `status` = 'dikembalikan', `tanggal_kembali` = '2026-06-09', `updated_at` = '2026-06-09 04:59:36'
WHERE `peminjaman`.`id` IN ('3')
SELECT *
FROM `items`
WHERE `items`.`id` = '18'
UPDATE `items` SET `stock` = 30, `updated_at` = '2026-06-09 04:59:36'
WHERE `items`.`id` IN ('18')
---
    public function store()
    {
        $peminjamanId = $this->request->getPost('peminjaman_id');

        $pinjam = $this->peminjamanModel->find($peminjamanId);

        if (!$pinjam) {
            return redirect()->back();
        }

        $kode = 'KMB-' . date('Y') . '-' .
            str_pad(
                $this->pengembalianModel->countAll() + 1,
                4,
                '0',
                STR_PAD_LEFT
            );

        $this->pengembalianModel->save([
            'kode_pengembalian' => $kode,
            'peminjaman_id' => $peminjamanId,
            'tanggal_kembali' =>
                $this->request->getPost('tanggal_kembali'),
            'kondisi_barang' =>
                $this->request->getPost('kondisi_barang'),
            'keterangan' =>
                $this->request->getPost('keterangan')
        ]);

        $this->peminjamanModel->update(
            $peminjamanId,
            [
                'status' => 'dikembalikan',
                'tanggal_kembali' =>
                    $this->request->getPost('tanggal_kembali')
            ]
        );

        $barang = $this->itemModel->find(
            $pinjam['barang_id']
        );

        if ($barang) {

            $this->itemModel->update(
                $barang['id'],
                [
                    'stock' =>
                        $barang['stock']
                        + $pinjam['jumlah']
                ]
            );