app/Controllers/Report.php

SELECT *
FROM `items`
SELECT *
FROM `pengadaan`
SELECT *
FROM `peminjaman`
SELECT *
FROM `pengembalian`
---
    public function index()
    {
        $data = [
            'title' => 'Data Laporan',

            'barang' => $this->itemModel->findAll(),

            'pengadaan' => $this->pengadaanModel->findAll(),

            'peminjaman' => $this->peminjamanModel->findAll(),

            'pengembalian' => $this->pengembalianModel->findAll()