app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {
        return view('users/index', [
            'title' => 'Pengguna',
            'users' => $this->userModel->findAll()